[
    {
        "recording_name": "knowledgelink",
        "date": "2025-02-21",
        "summary": "knowledge link",
        "detail_summary": "knowledge link allows users to search content from the recordings",
        "url_location": "https://nokia.sharepoint.com/:f:/r/sites/apj-ldo/npo/Knowledge%20Library/knowledgelink",
        "presenter_name": "AIML Team",
        "Tag": "LDO, Knowledge, Sharing Session,LLM"
    },
    {
        "recording_name": "4G Call Access",
        "date": "2025-03-21",
        "summary": "### **Main Topics Discussed** - Overview of **4G Call Access Mechanisms**. - Detailed **Call Flow Process** from **attach to termination**. - Explanation of **Key Network Elements** (EPC, IMS, VoLTE). - **Handover Scenarios** and **Inter-RAT Mobility**. - **Common Issues and Troubleshooting Methods**. - **Comparison of 4G and 5G Call Access Approaches**.  ### **Core Takeaways** - **VoLTE** enables voice calls over LTE, managed by IMS and EPC. - Call setup involves **SIP signaling and QoS enforcement**. - **SRVCC ensures continuity** when switching from 4G to 3G/2G. - **Network tools like Wireshark** help analyze call failures and signaling issues.  ### **Important Tools & Technologies Mentioned** - **Wireshark** (for VoLTE SIP/RTP analysis) - **Nemo Outdoor** (field test LTE tool) - **Packet Core Monitoring Systems** (NetAct, ENM)  ### **Key Best Practices & Recommendations** - **Optimize LTE Coverage** to reduce unnecessary handovers. - **Monitor QoS Metrics** to maintain voice quality. - **Use Drive Tests & Packet Analysis** for troubleshooting. - **Regular IMS Configuration Audits** to prevent call registration failures.",
        "detail_summary": "### **Key Topics Covered** - **4G Call Access Fundamentals** - **Call Flow in 4G Networks** - **Key Network Elements and Functions** - **Signaling and Protocols in 4G Call Access** - **Handover Scenarios in 4G** - **Common Issues and Troubleshooting in 4G Call Access** - **Comparison of 4G and 5G Call Access Mechanisms**  ### **Definitions & Concepts** - **4G Call Access**: The process by which a mobile device connects to a network to initiate or receive a call using LTE technology. - **Evolved Packet Core (EPC)**: The backbone of LTE networks responsible for managing connectivity and data flow. - **VoLTE (Voice over LTE)**: A technology enabling voice calls over a 4G LTE network instead of traditional circuit-switched networks. - **IMS (IP Multimedia Subsystem)**: A framework for delivering IP-based multimedia services, including VoLTE. - **SRVCC (Single Radio Voice Call Continuity)**: A mechanism allowing seamless handover of VoLTE calls to legacy 3G/2G networks when 4G coverage is weak.  ### **Processes & Methodologies** #### **4G Call Flow: Step-by-Step** 1. **Attach Process**: The device registers with the network through the EPC and obtains an IP address. 2. **Call Setup**:    - IMS registration using SIP signaling.    - Call establishment through the IMS core.    - Media negotiation via SDP (Session Description Protocol). 3. **Call Transmission**:    - RTP (Real-time Transport Protocol) is used for voice data.    - QoS (Quality of Service) parameters are enforced to maintain call clarity. 4. **Call Termination**:    - SIP BYE message exchanged between devices.    - Release of network resources.  #### **Handover Scenarios in 4G Call Access** - **Intra-LTE Handover**: Transitioning between LTE cells within the same network. - **Inter-RAT Handover**: Moving between LTE and a different radio access technology (e.g., 3G or 2G using SRVCC).  #### **Troubleshooting & Common Issues** - **Call Drops**: Often due to poor LTE coverage or failed handovers. - **One-Way Audio**: Usually caused by incorrect IMS configurations or firewall blocking RTP packets. - **Registration Failures**: Commonly due to misconfigured APNs or network congestion.  ### **Tools & Technologies** - **Wireshark**: Used for analyzing VoLTE call signaling and RTP streams. - **Nemo Outdoor**: A field test tool for LTE network measurements. - **Drive Test Tools**: Used for performance testing and coverage analysis. - **Packet Core Monitoring Systems**: Tools such as NetAct or ENM (Ericsson Network Manager) for monitoring core network performance.  ### **Technical Insights & Best Practices** - **Optimize VoLTE Coverage**: Ensure proper LTE radio planning to minimize SRVCC handovers. - **Regularly Monitor QoS Parameters**: Prioritize VoLTE traffic in EPC configurations. - **Use KPIs for Call Performance Evaluation**: Metrics such as Call Setup Success Rate (CSSR) and Drop Call Rate (DCR) are critical indicators. - **Preemptive Testing**: Regular drive tests and signaling analysis can help prevent service degradation.",
        "url_location": "https://nokia.sharepoint.com/:f:/r/sites/apj-ldo/npo/Knowledge%20Library/4g_call_access",
        "presenter_name": "Kobchai Noimesat",
        "Tag": "4G, VoLTE, LTE Call Flow, IMS, SRVCC, Call Handover, Troubleshooting, SIP, EPC, QoS"
    },
    {
        "recording_name": "3G Call Access",
        "date": "2024-06-22",
        "summary": "This session provided a technical overview of 3G call access, a legacy technology still in use. The presentation covered the evolution of mobile technology from 1G to 5G, highlighting the key differences in bandwidth, modulation, and speed. It then explained the network architecture of 3G, detailing the roles of components like RNC, MSC, and SGSN. The session concluded with a detailed explanation of the call flow for both mobile originating and mobile terminating calls in 3G, outlining the steps involved in establishing a connection, authentication, and data transfer.",
        "detail_summary": "Key Topics Covered: Evolution of Mobile Technology (1G-5G) 3G Call Access 3G Network Architecture 3G Call Flow (Mobile Originating & Terminating) Definitions & Concepts:  1G: First generation of mobile technology, using analog signals for voice communication. 2G: Second generation, introducing digital signals and GSM (Global System for Mobile Communications) for voice and limited data. 3G: Third generation, offering higher data throughput, video streaming, and WCDMA (Wideband Code Division Multiple Access) modulation. 4G: Fourth generation, characterized by even higher data speeds and LTE (Long-Term Evolution) technology. 5G: Fifth generation, focusing on ultra-high speeds, low latency, and massive connectivity. RNC (Radio Network Controller): Manages radio resources, schedules packets, and balances network load. MSC (Mobile Switching Center): Controls call setup, session management, and data services. SGSN (Serving GPRS Support Node): Handles data services, authentication, and user data management. WCDMA (Wideband Code Division Multiple Access): A modulation technique used in 3G, providing wider bandwidth and higher data rates. HSPA (High-Speed Packet Access): A set of enhancements to WCDMA, offering faster data speeds (up to 168 Mbps). Processes & Methodologies: 3G Call Flow: Mobile Originating Call: UE (User Equipment) initiates a call request. RNC forwards the request to MSC. MSC authenticates the user and allocates a circuit switch. Alerting message is sent to the destination UE. Upon answer, a connection is established. Data transfer occurs. Call release initiated by either UE. Connection and resources are released. Mobile Terminating Call: UE receives a call request. RNC handles paging and authentication. MSC checks security and forwards the call. Alerting message is sent to the originating UE. Upon answer, a connection is established. Data transfer occurs. Call release initiated by either UE. Connection and resources are released. Tools & Technologies:  GSM (Global System for Mobile Communications): 2G technology standard. WCDMA (Wideband Code Division Multiple Access): 3G modulation technique. HSPA (High-Speed Packet Access): 3G technology enhancement. LTE (Long-Term Evolution): 4G technology standard. 5G NR (New Radio): 5G technology standard. Technical Insights & Best Practices:  3G call access is a legacy technology that still plays a role in mobile communication. 3G offers higher data throughput and video streaming capabilities compared to 2G. 3G network architecture involves key components like RNC, MSC, and SGSN, each with specific functions. Understanding the call flow in 3G is crucial for troubleshooting and optimizing network performance.",
        "url_location": "https://sharepoint.nokia.com/npo/3gcallaccess",
        "presenter_name": "AAA BBBB",
        "Tag": "3G"
    },
    {
        "recording_name": "NDE Nokia Design Engine",
        "date": "2024-06-15",
        "summary": "This session provided an overview of Nokia NDE (Network Design Engine) planning tool. NDE is a cloud-based platform that integrates various network planning tools like 9955, DD4EE, and Smart CapEx. It offers features for cell planning, traffic analysis, EMF exposure analysis, and network optimization. Key takeaways include:  NDE requires a license and training to access and use effectively. It offers a hybrid approach with 9955 for specific tasks. It provides advanced features for 5G network planning and optimization. It relies on data from various sources, including MDM and OSS KPI. It has limitations, so a thorough understanding of network planning is crucial. Important tools mentioned include NDE, 9955, RDP, and VPN. Key best practices include proper training, data validation, and consulting with vertical leads and mentors.",
        "detail_summary": "Key Topics Covered:  Introduction to NDE (Network Design Engine) Planning Tool NDE Features and Functionality Accessing and Using NDE NDE License Acquisition and Training NDE Integration with Existing Tools (e.g., 9955, D4ES, Smart CapEx) NDE Limitations and Best Practices Definitions & Concepts:  NDE (Network Design Environment): A cloud-based planning tool for network design and optimization. RVM (Virtual Messaging): Hardware used by NDE's cloud server for scalability. API (Application Programming Interface): Used to control the 9955 application. MDM (Master Data Management): Data source for NDE input. OSS KPI (Operations Support System Key Performance Indicator): Data source for traffic analysis and automatic traffic detection. EMF (Electromagnetic Field): Exposure analysis feature in NDE. 2.5D, 3D Publication Model: Different models used for network planning and prediction. G2G Technology: Supported by NDE. Key Space: A virtual space within NDE where projects and data are stored. Key Spare License: A license required to access and use NDE. Customer Spare: A specific area within NDE where projects are created and managed. ATL (Automatic Traffic Load): Existing project data that can be imported into NDE. Hybrid Approach: Using both NDE and 9955 for specific tasks. PCI (Physical Cell ID): Used for cell planning and optimization. SNIR (Signal-to-Noise and Interference Ratio): A key parameter for network optimization. Isotov Kylia: A parameter used for indoor network optimization. Leckman Barrow: The result of a CPI (Capacity Planning Index) calculation. ACTA (Automatic Capacity and TCO Analysis): A feature for evaluating cell load and analyzing KPI data. I-Shipping: A feature for combining propagation models and data for more accurate predictions. Geo-Data: Data used for automatic traffic detection. Vertical Lead: A person responsible for providing access and training information for NDE. Processes & Methodologies:  Creating a New Project in NDE: Two methods: from scratch or importing an existing ATL project. Accessing NDE: Requires VPN connection and Nokia credentials. Importing Data into NDE: Data can be imported from various sources, including 9955, MDM, and OSS KPI. Hybrid Approach for NDE and 9955: Using both tools for specific tasks based on functionality and limitations. Automatic Traffic Detection: Uses Geo-data and OSS KPI data to analyze traffic patterns. EMF Exposure Analysis: Allows for setting trace hold values for EMF analysis. I-Shipping: Combines propagation models and data for more accurate predictions. Automatic Cell Planning: Optimizes cell parameters based on user-defined objectives. Capacity Analysis: Evaluates cell load and identifies areas for expansion. Network Optimization: Uses various features and tools to improve network performance. Tools & Technologies:  NDE (Network Design Environment): Cloud-based planning tool. 9955: A network planning tool. D4ES (Digital 4G Evolution System): A network planning tool. Smart CapEx: A network planning tool. RDP (Remote Desktop Protocol): Used to access NDE server. VPN (Virtual Private Network): Required for accessing NDE. Nokia Credentials: Used for logging into NDE. MDM (Master Data Management): Data source for NDE input. OSS KPI (Operations Support System Key Performance Indicator): Data source for traffic analysis. CSV (Comma Separated Values): File format for importing data. Technical Insights & Best Practices:  NDE is a powerful tool for network planning and optimization, but it has limitations. A hybrid approach using both NDE and 9955 is often necessary. Proper training is essential for using NDE effectively. Understanding the basic concepts of network planning is crucial for using NDE. Always verify the accuracy of predictions and analysis generated by NDE. Keep your data sources up-to-date for accurate results. Consult with vertical leads and mentors for guidance and support.",
        "url_location": "https://nokia.sharepoint.com/:f:/r/sites/apj-ldo/npo/Knowledge%20Library/Automation%20-%20NDE",
        "presenter_name": "XXX YYY",
        "Tag": "NDE, Nokia Design Environment, Network Planning, Optimization, API, Cloud Server, EMF Exposure, Traffic Detection, Automatic Cell Planning, Capacity Analysis, TCO Analysis, Licensing, Training"
    }
]